In [1]:
# Import libraries yang dibutuhkan
import pandas as pd
import numpy as np

In [2]:
# Membaca dataset
file_path = r"C:\Online Retail-unclean.xlsx"  # Ganti dengan lokasi file Anda
df = pd.read_excel(file_path)

# Tampilkan 5 baris pertama untuk memahami struktur data
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [3]:
# Lihat informasi dataset
df.info()

# Lihat statistik dasar dataset
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541904 non-null  float64
 6   CustomerID   406823 non-null  float64
 7   Country      541901 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

,Quantity,InvoiceDate,UnitPrice,CustomerID
count,541909.000000,541909,541904.000000,406823.000000
mean,9.552250,2011-07-04 13:34:57.156386048,4.611096,15287.708588
min,-80995.000000,2010-12-01 08:26:00,-11062.060000,12346.000000
25%,1.000000,2011-03-28 11:34:00,1.250000,13953.000000
50%,3.000000,2011-07-19 17:17:00,2.080000,15152.000000
75%,10.000000,2011-10-19 11:27:00,4.130000,16791.000000
max,80995.000000,2011-12-09 12:50:00,38970.000000,18287.000000
std,218.081158,NaN,96.760300,1713.598996

In [4]:
# Mengganti "NULL" dengan NaN
df.replace('NULL', np.nan, inplace=True)

# Periksa kembali data
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [5]:
# Ubah kolom InvoiceDate menjadi datetime
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'], errors='coerce')

# Ubah UnitPrice menjadi float (mengganti koma menjadi titik)
df['UnitPrice'] = df['UnitPrice'].astype(str).str.replace(',', '.').astype(float)

# Ubah Quantity menjadi numeric
df['Quantity'] = pd.to_numeric(df['Quantity'], errors='coerce')

# Lihat tipe data setelah perubahan
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541904 non-null  float64
 6   CustomerID   406823 non-null  float64
 7   Country      541901 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [6]:
# Hapus baris dengan NaN di kolom penting
df.dropna(subset=['InvoiceDate', 'Quantity', 'UnitPrice', 'CustomerID'], inplace=True)

# Hapus baris dengan nilai negatif atau nol di Quantity dan UnitPrice
df = df[(df['Quantity'] > 0) & (df['UnitPrice'] > 0)]

# Periksa jumlah baris setelah pembersihan
df.shape

(397866, 8)

In [7]:
# Hapus baris duplikat
df.drop_duplicates(inplace=True)

# Periksa jumlah baris setelah menghapus duplikasi
df.shape

(392674, 8)

In [8]:
# Normalisasi kolom Description: hilangkan spasi tambahan dan ubah ke huruf besar
df['Description'] = df['Description'].str.strip().str.upper()

# Periksa contoh data setelah normalisasi
df['Description'].head()

0     WHITE HANGING HEART T-LIGHT HOLDER
1                    WHITE METAL LANTERN
2         CREAM CUPID HEARTS COAT HANGER
3    KNITTED UNION FLAG HOT WATER BOTTLE
4         RED WOOLLY HOTTIE WHITE HEART.
Name: Description, dtype: object

In [9]:
# Simpan dataset yang telah dibersihkan ke file baru
cleaned_file_path = 'cleaned_retail.xlsx'  # Ganti dengan nama file output
df.to_excel(cleaned_file_path, index=False)

print("Data cleaned and saved to:", cleaned_file_path)

Data cleaned and saved to: cleaned_retail.xlsx